<a href="https://colab.research.google.com/github/Ritumahour/SQL_Assign/blob/main/Copy_of_SQL_assign.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

1.Create a table called employees with the following structure?
  .emp_id (integer, should not be NULL and should be a primary key)
  .emp_name (text, should not be NULL)
  .age (integer, should have a check constraint to ensure the age is at least
  18)
  .email (text, should be unique for each employee)
  .salary (decimal, with a default value of 30,000).

Write the SQL query to create the above table with all constraints.

In [ ]:
create_table_query = """
CREATE TABLE employees (
    emp_id INTEGER NOT NULL PRIMARY KEY,
    emp_name TEXT NOT NULL,
    age INTEGER CHECK (age >= 18),
    email TEXT UNIQUE,
    salary DECIMAL(10, 2) DEFAULT 30000
);
"""

2. Explain the purpose of constraints and how they help maintain data integrity in a database. Provide
examples of common types of constraints.

Ans.  Common Types of Constraints
 1).NOT NULL: Ensures that a column cannot have a NULL value.

Example: emp_name TEXT NOT NULL ensures every employee has a name.

 2).UNIQUE: Guarantees that all values in a column are distinct.

Example: email TEXT UNIQUE ensures no two employees share the same email address.

 3).PRIMARY KEY: Combines NOT NULL and UNIQUE to uniquely identify each row in a table.

Example: emp_id INTEGER PRIMARY KEY uniquely identifies each employee.

 4).FOREIGN KEY: Establishes a link between the data in two tables, enforcing referential integrity.
Wikipedia

Example: department_id INTEGER REFERENCES departments(dept_id) ensures that an employee's department exists in the departments table.

 5).CHECK: Validates that data in a column meets a specific condition.

Example: age INTEGER CHECK (age >= 18) ensures employees are at least 18 years old.

 6).DEFAULT: Assigns a default value to a column when no value is specified.

Example: salary DECIMAL(10, 2) DEFAULT 30000 sets the default salary to 30,000 if not provided.

3.Why would you apply the NOT NULL constraint to a column? Can a primary key contain NULL values? Justify
your answer.

Ans.  Why Use the NOT NULL Constraint?
 1.Enforce Mandatory Data Entry: By preventing NULL values, you ensure that essential information is always provided. For example, an emp_name column with a NOT NULL constraint ensures that every employee record includes a name.

 2.Maintain Data Integrity: NOT NULL constraints help maintain the accuracy and reliability of the data by disallowing missing or undefined values in important columns.

 3.Optimize Query Performance: Some database systems can optimize queries better when they know certain columns cannot be NULL, potentially improving performance.

No, a primary key cannot contain NULL values. The primary key uniquely identifies each record in a table, and allowing NULL values would violate this uniqueness requirement. In SQL, defining a primary key automatically implies that the column is both NOT NULL and UNIQUE.

This principle is rooted in the concept of entity integrity, which mandates that every table must have a primary key, and that the columns comprising the primary key must be defined as NOT NULL. This ensures that each record can be uniquely identified and that no ambiguity exists due to missing values.
Wikipedia

In summary, applying the NOT NULL constraint is crucial for ensuring that essential data is always present, and primary keys inherently require non-NULL values to maintain the uniqueness and integrity of each record in a table.

4. Explain the steps and SQL commands used to add or remove constraints on an existing table. Provide an
example for both adding and removing a constraint.

ALTER TABLE table_name
ADD CONSTRAINT constraint_name constraint_type (column_name);
Common constraints you can add:
PRIMARY KEY

FOREIGN KEY

UNIQUE

CHECK

NOT NULL (different syntax, usually with ALTER COLUMN)

Example: Add a UNIQUE constraint on email column of the customer table
sql
Copy
Edit
ALTER TABLE customer
ADD CONSTRAINT unique_email UNIQUE (email);
Example: Add a FOREIGN KEY constraint
Suppose you want to ensure customer_id in orders references customer_id in customer:

sql
Copy
Edit
ALTER TABLE orders
ADD CONSTRAINT fk_customer
FOREIGN KEY (customer_id) REFERENCES customer(customer_id);
Removing (Dropping) Constraints from an Existing Table
You also use ALTER TABLE with DROP CONSTRAINT to remove constraints.

Syntax:
sql
Copy
Edit
ALTER TABLE table_name
DROP CONSTRAINT constraint_name;
Note: You need to know the name of the constraint you want to drop.

Example: Remove the UNIQUE constraint named unique_email from the customer table
sql
Copy
Edit
ALTER TABLE customer
DROP CONSTRAINT unique_email;
Important Notes:
Constraint names can be system-generated if you didn’t name them explicitly, so it’s good practice to name constraints when creating them.

Some constraints, like NOT NULL, are removed differently (for example, dropping NOT NULL requires altering the column).

Example: Drop NOT NULL constraint on email column (syntax varies by DBMS):
sql
Copy
Edit
ALTER TABLE customer
ALTER COLUMN email DROP NOT NULL;

5. Explain the consequences of attempting to insert, update, or delete data in a way that violates constraints.
Provide an example of an error message that might occur when violating a constraint.

Common types of constraints and consequences of violating them:
Primary Key Constraint:

Ensures each row has a unique identifier.

Violation: Trying to insert a duplicate primary key value.

Consequence: Insert/update is rejected; no duplicate keys allowed.

Foreign Key Constraint:

Ensures a value in one table matches a value in another table (referential integrity).

Violation: Trying to insert or update a foreign key value that doesn’t exist in the referenced table, or trying to delete a parent row that has dependent child rows.

Consequence: Operation rejected to prevent orphan records.

Unique Constraint:

Ensures values in a column (or group of columns) are unique.

Violation: Inserting or updating a value that already exists in the unique column(s).

Consequence: Operation rejected to maintain uniqueness.

Not Null Constraint:

Ensures a column cannot have NULL values.

Violation: Trying to insert or update a NULL value in that column.

Consequence: Operation rejected.

Check Constraint:

Ensures values in a column satisfy a specific condition.

Violation: Inserting or updating a value that fails the condition.

Consequence: Operation rejected.

Example of an error message:
Suppose you have a customer table where customer_id is the primary key. If you try to insert a duplicate customer_id, you might get an error like:

plaintext
Copy
Edit
ERROR: duplicate key value violates unique constraint "customer_pkey"
DETAIL: Key (customer_id)=(1) already exists.

6. You created a products table without constraints as follows:

CREATE TABLE products (

    product_id INT,

    product_name VARCHAR(50),

    price DECI

Now, you realise that?
: The product_id should be a primary keyQ
: The price should have a default value of 50.00

Ans. ALTER TABLE products
ADD CONSTRAINT pk_product_id PRIMARY KEY (product_id);

ALTER TABLE products
ALTER COLUMN price SET DEFAULT 50.00;

 SQL COMMANDS

1. Identify the primary keys and foreign keys in maven movies db. Discuss the differences

Ans. Primary key: -
Primary keys do not allow two rows to have the same values.
Insertion	Values ​​can be inserted even if the foreign key does not have that value.
Range	Each relational database table row can have only one primary key.
Clustered index	Primary keys, by default, have a clustered index.
Suppression	When a value is to be removed, the value must be made to not already be present in the foreign key reference table.
Temporary Tables	Primary keys can be defined in a temporary table.

 Foreign key:-
Foreign keys allow the two rows to have the same values.
Values​ cannot be inserted if the values ​​are not present in the primary key.
A relational database table can have numerous foreign keys.
Foreign keys do not have a clustered index.
When a value is removed, it can quickly be done from foreign keys.
Foreign keys cannot be defined in a temporary table.

2- List all details of actors

SELECT * FROM actor;

3 -List all customer information from DB.

SELECT * FROM customer;

4 -List different countries.

SELECT country_id, country
FROM country
ORDER BY country;

5 -Display all active customers.

SELECT * FROM customer WHERE active = 1;

6 -List of all rental IDs for customer with ID 1.

SELECT rental_id
FROM rental
WHERE customer_id = 1;

7 - Display all the films whose rental duration is greater than 5

SELECT film_id, title, rental_duration
FROM film
WHERE rental_duration > 5;

8 - List the total number of films whose replacement cost is greater than $15 and less than $20.

SELECT COUNT(*) AS total_films
FROM film
WHERE replacement_cost > 15 AND replacement_cost < 20;

9 - Display the count of unique first names of actors.

SELECT COUNT(DISTINCT first_name) AS unique_first_names
FROM actor;

10- Display the first 10 records from the customer table .

SELECT *
FROM customer
LIMIT 10;

11 - Display the first 3 records from the customer table whose first name starts with ‘b’.

SELECT *
FROM customer
WHERE first_name LIKE 'B%'
LIMIT 3;

12 -Display the names of the first 5 movies which are rated as ‘G’.

SELECT title
FROM film
WHERE rating = 'G'
LIMIT 5;

13-Find all customers whose first name starts with "a".

SELECT *
FROM customer
WHERE first_name LIKE 'A%';

14- Find all customers whose first name ends with "a".

SELECT *
FROM customer
WHERE first_name LIKE '%a';

15- Display the list of first 4 cities which start and end with ‘a’

SELECT city
FROM city
WHERE city LIKE 'A%a'
LIMIT 4;

16- Find all customers whose first name have "NI" in any position

SELECT *
FROM customer
WHERE first_name LIKE '%NI%';

17- Find all customers whose first name have "r" in the second position .

SELECT *
FROM customer
WHERE first_name LIKE '_r%';

18 - Find all customers whose first name starts with "a" and are at least 5 characters in length.

SELECT *
FROM customer
WHERE first_name LIKE 'a%' AND LENGTH(first_name) >= 5;

19- Find all customers whose first name starts with "a" and ends with "o".

SELECT *
FROM customer
WHERE first_name LIKE 'a%o';

20 - Get the films with pg and pg-13 rating using IN operator.

SELECT *
FROM film
WHERE rating IN ('PG', 'PG-13');

21 - Get the films with length between 50 to 100 using between operator.

SELECT *
FROM film
WHERE length BETWEEN 50 AND 100;

22 - Get the top 50 actors using limit operator

SELECT *
FROM actor
LIMIT 50;

23 - Get the distinct film ids from inventory table

SELECT DISTINCT film_id
FROM inventory;

Question 1:

Retrieve the total number of rentals made in the Sakila database.

Hint: Use the COUNT() function

SELECT COUNT(*) AS total_rentals
FROM rental;

Question 2:

Find the average rental duration (in days) of movies rented from the Sakila database.

Hint: Utilize the AVG() function.

SELECT AVG(rental_duration) AS average_rental_duration
FROM film;

Question 3:

Display the first name and last name of customers in uppercase.

Hint: Use the UPPER () function.

SELECT UPPER(first_name) AS first_name_upper,
       UPPER(last_name) AS last_name_upper
FROM customer;

Question 4:

Extract the month from the rental date and display it alongside the rental ID.

Hint: Employ the MONTH() function

SELECT rental_id,
       MONTH(rental_date) AS rental_month
FROM rental;

Question 5:

Retrieve the count of rentals for each customer (display customer ID and the count of rentals).

Hint: Use COUNT () in conjunction with GROUP BY.

SELECT customer_id,
       COUNT(*) AS rental_count
FROM rental
GROUP BY customer_id;

Question 6:

Find the total revenue generated by each store.

Hint: Combine SUM() and GROUP BY.

SELECT s.store_id,
       SUM(p.amount) AS total_revenue
FROM payment p
JOIN staff s ON p.staff_id = s.staff_id
GROUP BY s.store_id;

Question 7:

Determine the total number of rentals for each category of movies.

Hint: JOIN film_category, film, and rental tables, then use cOUNT () and GROUP BY

SELECT c.name AS category,
       COUNT(r.rental_id) AS total_rentals
FROM rental r
JOIN inventory i ON r.inventory_id = i.inventory_id
JOIN film f ON i.film_id = f.film_id
JOIN film_category fc ON f.film_id = fc.film_id
JOIN category c ON fc.category_id = c.category_id
GROUP BY c.name
ORDER BY total_rentals DESC;

Question 8:

Find the average rental rate of movies in each language.

Hint: JOIN film and language tables, then use AVG () and GROUP BY

SELECT l.name AS language,
       AVG(f.rental_rate) AS average_rental_rate
FROM film f
JOIN language l ON f.language_id = l.language_id
GROUP BY l.name
ORDER BY average_rental_rate DESC;

Questions 9 -

Display the title of the movie, customer s first name, and last name who rented it.

Hint: Use JOIN between the film, inventory, rental, and customer tables.

SELECT f.title AS movie_title,
       c.first_name,
       c.last_name
FROM rental r
JOIN inventory i ON r.inventory_id = i.inventory_id
JOIN film f ON i.film_id = f.film_id
JOIN customer c ON r.customer_id = c.customer_id;

Question 10:

Retrieve the names of all actors who have appeared in the film "Gone with the Wind."

Hint: Use JOIN between the film actor, film, and actor tables.

SELECT a.first_name, a.last_name
FROM actor a
JOIN film_actor fa ON a.actor_id = fa.actor_id
JOIN film f ON fa.film_id = f.film_id
WHERE f.title = 'Gone with the Wind';

Question 11:

Retrieve the customer names along with the total amount they've spent on rentals.

Hint: JOIN customer, payment, and rental tables, then use SUM() and GROUP BY.

SELECT c.first_name,
       c.last_name,
       SUM(p.amount) AS total_spent
FROM customer c
JOIN payment p ON c.customer_id = p.customer_id
JOIN rental r ON p.rental_id = r.rental_id
GROUP BY c.customer_id, c.first_name, c.last_name
ORDER BY total_spent DE_

Question 12:

List the titles of movies rented by each customer in a particular city (e.g., 'London').

Hint: JOIN customer, address, city, rental, inventory, and film tables, then use GROUP BY.

SELECT c.customer_id,
       c.first_name,
       c.last_name,
       GROUP_CONCAT(f.title ORDER BY f.title) AS rented_movies
FROM customer c
JOIN address a ON c.address_id = a.address_id
JOIN city ci ON a.city_id = ci.city_id
JOIN rental r ON c.customer_id = r.customer_id
JOIN inventory i ON r.inventory_id = i.inventory_id
JOIN film f ON i.film_id = f.film_id
WHERE ci.city = 'London'
GROUP BY c.customer_id, c.first_name, c.last_name
ORDER BY c.last_name, c.first_name;

Question 13:

Display the top 5 rented movies along with the number of times they've been rented.

Hint: JOIN film, inventory, and rental tables, then use COUNT () and GROUP BY, and limit the results.

SELECT f.title,
       COUNT(r.rental_id) AS rental_count
FROM film f
JOIN inventory i ON f.film_id = i.film_id
JOIN rental r ON i.inventory_id = r.inventory_id
GROUP BY f.film_id, f.title
ORDER BY rental_count DESC
LIMIT 5;

Question 14:

Determine the customers who have rented movies from both stores (store ID 1 and store ID 2).

Hint: Use JOINS with rental, inventory, and customer tables and consider COUNT() and GROUP BY.

SELECT c.customer_id, c.first_name, c.last_name
FROM customer c
JOIN rental r ON c.customer_id = r.customer_id
JOIN inventory i ON r.inventory_id = i.inventory_id
WHERE i.store_id IN (1, 2)
GROUP BY c.customer_id, c.first_name, c.last_name
HAVING COUNT(DISTINCT i.store_id) = 2;

Windows Function:

1. Rank the customers based on the total amount they've spent on rentals

SELECT
    c.customer_id,
    c.first_name,
    c.last_name,
    SUM(p.amount) AS total_spent,
    RANK() OVER (ORDER BY SUM(p.amount) DESC) AS spending_rank
FROM customer c
JOIN payment p ON c.customer_id = p.customer_id
GROUP BY c.customer_id, c.first_name, c.last_name
ORDER BY spending_rank;

2. Calculate the cumulative revenue generated by each film over time

SELECT
    f.film_id,
    f.title,
    p.payment_date,
    SUM(p.amount) OVER (PARTITION BY f.film_id ORDER BY p.payment_date
                        ROWS BETWEEN UNBOUNDED PRECEDING AND CURRENT ROW) AS cumulative_revenue
FROM payment p
JOIN rental r ON p.rental_id = r.rental_id
JOIN inventory i ON r.inventory_id = i.inventory_id
JOIN film f ON i.film_id = f.film_id
ORDER BY f.film_id, p.payment_date;

3. Determine the average rental duration for each film, considering films with similar lengths.

SELECT
    FLOOR(f.length / 30) * 30 AS length_range_start,
    FLOOR(f.length / 30) * 30 + 29 AS length_range_end,
    AVG(f.rental_duration) AS average_rental_duration,
    COUNT(*) AS film_count
FROM film f
GROUP BY length_range_start, length_range_end
ORDER BY length_range_start;

4. Identify the top 3 films in each category based on their rental counts.

SELECT category_name, film_title, rental_count
FROM (
    SELECT
        c.name AS category_name,
        f.title AS film_title,
        COUNT(r.rental_id) AS rental_count,
        ROW_NUMBER() OVER (PARTITION BY c.category_id ORDER BY COUNT(r.rental_id) DESC) AS rn
    FROM film f
    JOIN film_category fc ON f.film_id = fc.film_id
    JOIN category c ON fc.category_id = c.category_id
    JOIN inventory i ON f.film_id = i.film_id
    JOIN rental r ON i.inventory_id = r.inventory_id
    GROUP BY c.category_id, c.name, f.film_id, f.title
) ranked_films
WHERE rn <= 3
ORDER BY category_name, rental_count DESC;

5. Calculate the difference in rental counts between each customer's total rentals and the average rentals

across all customers.

WITH customer_rentals AS (
    SELECT
        customer_id,
        COUNT(*) AS total_rentals
    FROM rental
    GROUP BY customer_id
),
average_rentals AS (
    SELECT AVG(total_rentals) AS avg_rentals
    FROM customer_rentals
)
SELECT
    cr.customer_id,
    cr.total_rentals,
    ar.avg_rentals,
    cr.total_rentals - ar.avg_rentals AS difference_from_average
FROM customer_rentals cr
CROSS JOIN average_rentals ar
ORDER BY difference_from_average DESC;

6. Find the monthly revenue trend for the entire rental store over time.

SELECT
    DATE_FORMAT(p.payment_date, '%Y-%m') AS year_month,
    SUM(p.amount) AS total_revenue
FROM payment p
GROUP BY year_month
ORDER BY year_month;

7. Identify the customers whose total spending on rentals falls within the top 20% of all customers.

WITH customer_spending AS (
    SELECT
        c.customer_id,
        c.first_name,
        c.last_name,
        SUM(p.amount) AS total_spent
    FROM customer c
    JOIN payment p ON c.customer_id = p.customer_id
    GROUP BY c.customer_id, c.first_name, c.last_name
),
spending_threshold AS (
    SELECT
        PERCENTILE_CONT(0.8) WITHIN GROUP (ORDER BY total_spent) AS threshold
    FROM customer_spending
)
SELECT
    cs.customer_id,
    cs.first_name,
    cs.last_name,
    cs.total_spent
FROM customer_spending cs, spending_threshold st
WHERE cs.total_spent >= st.threshold
ORDER BY cs.total_spent DESC;

8. Calculate the running total of rentals per category, ordered by rental count.

WITH category_rentals AS (
    SELECT
        c.category_id,
        c.name AS category_name,
        COUNT(r.rental_id) AS rental_count
    FROM category c
    JOIN film_category fc ON c.category_id = fc.category_id
    JOIN inventory i ON fc.film_id = i.film_id
    JOIN rental r ON i.inventory_id = r.inventory_id
    GROUP BY c.category_id, c.name
)
SELECT
    category_name,
    rental_count,
    SUM(rental_count) OVER (ORDER BY rental_count) AS running_total_rentals
FROM category_rentals
ORDER BY rental_count;

9. Find the films that have been rented less than the average rental count for their respective categories.

WITH film_rentals AS (
    SELECT
        f.film_id,
        f.title,
        c.category_id,
        c.name AS category_name,
        COUNT(r.rental_id) AS rental_count
    FROM film f
    JOIN film_category fc ON f.film_id = fc.film_id
    JOIN category c ON fc.category_id = c.category_id
    LEFT JOIN inventory i ON f.film_id = i.film_id
    LEFT JOIN rental r ON i.inventory_id = r.inventory_id
    GROUP BY f.film_id, f.title, c.category_id, c.name
),
category_avg AS (
    SELECT
        category_id,
        AVG(rental_count) AS avg_rental_count
    FROM film_rentals
    GROUP BY category_id
)
SELECT
    fr.film_id,
    fr.title,
    fr.category_name,
    fr.rental_count,
    ca.avg_rental_count
FROM

10. Identify the top 5 months with the highest revenue and display the revenue generated in each month.

SELECT
    DATE_FORMAT(payment_date, '%Y-%m') AS year_month,
    SUM(amount) AS total_revenue
FROM payment
GROUP BY year_month
ORDER BY total_revenue DESC
LIMIT 5;

Normalisation & CTE

1. First Normal Form (1NF):

 a. Identify a table in the Sakila database that violates 1NF. Explain how you

 would normalize it

 Definition of 1NF (First Normal Form):
A relation (table) is in 1NF if:

All attributes (columns) contain only atomic (indivisible) values.

There are no repeating groups or arrays/multiple values in a single column.

 Identifying a Table in Sakila that Violates 1NF
In the Sakila sample database, the address table potentially violates 1NF because of the phone field. But a clearer example would be the film table due to its many-to-many relationships being flattened into non-atomic fields in poorly designed systems.

However, in Sakila, the database is already normalized. But let’s assume a denormalized version of a table like film_actor where:

 Hypothetical example of a bad (1NF-violating) film table:
film_id	title	actor_names
1	Jurassic Park	Sam Neill, Laura Dern
2	Titanic	Leonardo DiCaprio, Kate Winslet

Here, actor_names contains multiple values in a single field (comma-separated), violating 1NF.

 How to Normalize It to 1NF
To bring this table into 1NF, we need to remove the repeating group and make each field atomic by creating a separate table to represent the many-to-many relationship.

 Step-by-step Normalization:
Create separate tables:

film(film_id, title)

actor(actor_id, name)

film_actor(film_id, actor_id) → This is the junction (bridge) table.

Example after normalization:

film

film_id	title
1	Jurassic Park
2	Titanic

actor

actor_id	name
1	Sam Neill
2	Laura Dern
3	Leonardo DiCaprio
4	Kate Winslet

film_actor

film_id	actor_id
1	1
1	2
2	3
2	4

This way, each column contains atomic values and the relationship is normalized.

 Summary:
1NF violation occurs when a field contains multiple values.

In Sakila, a denormalized version of film with a field like actor_names would violate 1NF.

Fix: Separate into related tables and use foreign keys to maintain relationships.

Would you like to see a real query from Sakila to demonstrate this structure?

2. Second Normal Form (2NF):

 a. Choose a table in Sakila and describe how you would determine whether it is in 2NF.

 If it violat

 Definition of 2NF:
A table is in Second Normal Form (2NF) if:

It is already in First Normal Form (1NF).

Every non-prime attribute (i.e., not part of any candidate key) is fully functionally dependent on the entire primary key, and not just part of it.

 Candidate Table: film_category
Let’s analyze the film_category table in the Sakila database.

Structure of film_category:

Column	Description
film_id	FK to film table
category_id	FK to category table
last_update	Timestamp

Primary Key: (film_id, category_id) → Composite key.

 Check: Is it in 2NF?
We look at each non-prime attribute and check if it's dependent on the entire composite key, not just a part of it.

Non-prime attribute: last_update

Is last_update dependent on:

Only film_id

Only category_id

Both film_id and category_id

If last_update is only related to film_id, not the combination of film_id + category_id, then it violates 2NF.

 Assume it Violates 2NF:
Let’s assume last_update is related only to the film (i.e., updated whenever the film record is updated). Then, we are storing redundant data across rows for each category the film has.

 To Normalize to 2NF:
Step 1: Remove Partial Dependency

If last_update belongs to the film entity and not the film-category pair:

Remove last_update from film_category.

Store it in the film table (if not already there).

 Revised Tables:
film_category

film_id	category_id
1	2
1	3

film

film_id	title	last_update
1	Jurassic Park	2024-06-01

Now, film_category has no partial dependencies — every non-key attribute depends on the full key.

 Summary:
Table: film_category

Issue: last_update may depend only on film_id, not the composite key.

Solution: Move last_update to the correct table (film) so that all attributes in film_category depend on the whole composite key, satisfying 2NF.

Would you like a real query to explore this data or normalize a different table?

3. Third Normal Form (3NF):

 a. Identify a table in Sakila that violates 3NF. Describe the transitive dependencies

 presen

 Definition of 3NF:
A table is in Third Normal Form (3NF) if:

It is already in Second Normal Form (2NF).

There is no transitive dependency — i.e., non-prime attributes do not depend on other non-prime attributes.

 Example Table: staff (from Sakila)
Let’s analyze the structure of the staff table:

Column	Description
staff_id	Primary key
first_name	Staff first name
last_name	Staff last name
address_id	FK to address table
address	Full address (violates 3NF)
city	City name (possibly here)
store_id	Store staff works in
...	Other fields

 Potential 3NF Violation:
Let’s assume that in a poorly normalized version of the table, we had the following columns:

staff_id	address_id	address	city	country

Here’s the problem:

address_id → address

address → city

city → country

So, we have a transitive dependency chain:

address_id → address → city → country

country is not directly dependent on staff_id (primary key), but on city, which is dependent on address, which is dependent on address_id — this violates 3NF.

 How to Normalize It to 3NF:
Break the table into smaller, related tables so that non-key attributes only depend on the primary key, not on other non-key attributes.

 Revised Normalized Tables:
staff (staff_id, first_name, last_name, address_id, store_id)

address (address_id, address, city_id)

city (city_id, city, country_id)

country (country_id, country)

Now the dependencies are:

staff → address_id

address → city_id

city → country_id

There are no transitive dependencies within any one table — this satisfies 3NF.

 Summary:
Violating Table: staff (if it includes address, city, country directly).

Transitive Dependencies: staff_id → address → city → country

Fix: Split into staff, address, city, country tables with proper foreign keys.

Would you like a diagram or ERD of the normalized structure for better understanding?

4. Normalization Process:

 a. Take a specific table in Sakila and guide through the process of normalizing it from the initial

 unnormalized f

 Selected Table: rental (Unnormalized)
Let’s assume the original (unnormalized) version of the rental table looks like this:

 Unnormalized Form (UNF):
rental_id	customer_name	films_rented	rental_date
1	John Smith	[Matrix, Inception, Titanic]	2024-05-01 10:00
2	Alice Johnson	[Avatar, Titanic]	2024-05-02 15:30

films_rented is a repeating group, storing multiple values in one column.

customer_name is not atomic, as we might need to separate first and last name.

 Step 1: Convert to First Normal Form (1NF)
 Goal:
Remove repeating groups

Ensure all fields are atomic

 1NF-compliant structure:
rental_id	customer_name	film_title	rental_date
1	John Smith	Matrix	2024-05-01 10:00
1	John Smith	Inception	2024-05-01 10:00
1	John Smith	Titanic	2024-05-01 10:00
2	Alice Johnson	Avatar	2024-05-02 15:30
2	Alice Johnson	Titanic	2024-05-02 15:30

Now each field holds atomic values, and we have one row per film rented.

 Step 2: Convert to Second Normal Form (2NF)
 Goal:
Remove partial dependencies

Non-key attributes must depend on the entire primary key

In this case, suppose the composite key is (rental_id, film_title). But customer_name depends only on rental_id, not the film.

 Normalize into separate tables:
rental (rental_id, customer_name, rental_date)

rental_film (rental_id, film_title)

This eliminates the partial dependency of customer_name on just rental_id.

 Step 3: Convert to Third Normal Form (3NF)
 Goal:
Remove transitive dependencies

Non-key attributes must depend only on the primary key, not other non-key attributes

Let’s say:

customer_name actually includes full name which should be broken down.

film_title may lead to redundancy; we should instead store film IDs.

 Final Normalized Structure:
rental (rental_id, customer_id, rental_date)

customer (customer_id, first_name, last_name)

rental_film (rental_id, film_id)

film (film_id, title, description, release_year, etc.)

 Summary of Normalization Process:
Step	Transformation Goal	Change Made
UNF	Original table with multivalued fields	films_rented had multiple values
1NF	Atomic values, no repeating groups	Separated each film into its own row
2NF	Eliminate partial dependencies	Moved customer_name to a separate rental table
3NF	Eliminate transitive dependencies	Created customer and film tables

Would you like me to create SQL statements for these normalized tables or show this process in a visual diagram (ERD)?

5. CTE Basics:

 a. Write a query using a CTE to retrieve the distinct list of actor names and the number of films they

 have acted in from th

 Goal:
From the Sakila database, get:

Actor’s full name (first_name + last_name)

Number of films they have acted in

 Tables Involved:
actor – contains actor details

film_actor – links actors and films

 Step-by-step using a CTE:
sql
Copy
Edit
-- Step 1: Use CTE to get film count per actor
WITH actor_film_count AS (
    SELECT
        a.actor_id,
        CONCAT(a.first_name, ' ', a.last_name) AS actor_name,
        COUNT(fa.film_id) AS film_count
    FROM
        actor a
    JOIN
        film_actor fa ON a.actor_id = fa.actor_id
    GROUP BY
        a.actor_id, a.first_name, a.last_name
)

-- Step 2: Select from CTE
SELECT
    actor_name,
    film_count
FROM
    actor_film_count
ORDER BY
    film_count DESC;
🧾 Output Example:
actor_name	film_count
John Smith	24
Emily Watson	21
Leonardo DiCaprio	18

 Explanation:
CTE actor_film_count: computes the number of films for each actor.

CONCAT(first_name, last_name): gives full name.

COUNT(film_id): total films per actor.

GROUP BY: groups data per actor.

ORDER BY: sorts by most films.

Would you like to filter this further, such as top 10 actors or only those with more than 10 films?

6. CTE with Joins:

 a. Create a CTE that combines information from the film and language tables to display the film title,

 language

 Goal:
Using a CTE, retrieve:

film.title

language.name (the language of the film)

 Tables Involved:
film

Columns: film_id, title, language_id, ...

language

Columns: language_id, name (language name)

 CTE Query with JOIN:
sql
Copy
Edit
-- Step 1: CTE that joins film and language tables
WITH film_language_cte AS (
    SELECT
        f.film_id,
        f.title AS film_title,
        l.name AS language_name
    FROM
        film f
    JOIN
        language l ON f.language_id = l.language_id
)

-- Step 2: Select from the CTE
SELECT
    film_title,
    language_name
FROM
    film_language_cte
ORDER BY
    film_title;
 Sample Output:
film_title	language_name
ACADEMY DINOSAUR	English
AFFAIR PREJUDICE	Italian
ALIEN CENTER	French

 Explanation:
The CTE named film_language_cte joins the film table with the language table using the language_id.

After defining the CTE, we query from it to get clean output of film titles with their respective languages.

Would you like to expand this to include rental rate, release year, or category as well?

7. CTE for Aggregation:

 a. Write a query using a CTE to find the total revenue generated by each customer (sum of payments)

 from

 Goal:
Retrieve:

Customer’s full name (first_name + last_name)

Total revenue (sum of all their payments)

 Tables Involved:
customer – contains customer info

payment – contains payment amounts linked to each customer

 CTE Query with Aggregation:
sql
Copy
Edit
-- Step 1: CTE to calculate total payment per customer
WITH customer_revenue AS (
    SELECT
        c.customer_id,
        CONCAT(c.first_name, ' ', c.last_name) AS customer_name,
        SUM(p.amount) AS total_revenue
    FROM
        customer c
    JOIN
        payment p ON c.customer_id = p.customer_id
    GROUP BY
        c.customer_id, c.first_name, c.last_name
)

-- Step 2: Select from the CTE
SELECT
    customer_name,
    total_revenue
FROM
    customer_revenue
ORDER BY
    total_revenue DESC;
 Sample Output:
customer_name	total_revenue
Mary Smith	220.50
John Doe	198.75
Alice Johnson	185.00

 Explanation:
The CTE customer_revenue groups payments by customer and calculates the total.

CONCAT(first_name, last_name) gives the full name.

Final SELECT retrieves the aggregated revenue per customer, ordered from highest to lowest.

Would you like to filter this for customers with more than ₹200 revenue or show only the top 10?

8. CTE with Window Functions:

 a. Utilize a CTE with a window function to rank films based on their rental duration from the film table

 Goal:
From the film table:

Rank films based on their rental_duration

Show film title, rental duration, and rank

 Table Involved:
film

Columns: film_id, title, rental_duration, etc.

 CTE with Window Function (RANK):
sql
Copy
Edit
-- Step 1: CTE with window function to rank films by rental_duration
WITH film_ranks AS (
    SELECT
        film_id,
        title,
        rental_duration,
        RANK() OVER (ORDER BY rental_duration DESC) AS duration_rank
    FROM
        film
)

-- Step 2: Select from the CTE
SELECT
    title,
    rental_duration,
    duration_rank
FROM
    film_ranks
ORDER BY
    duration_rank;
 Sample Output:
title	rental_duration	duration_rank
LOST WORLD	7	1
PIRATE ISLAND	7	1
GALAXY WARRIORS	6	3
ROMANTIC MISSION	5	4

 Explanation:
RANK() assigns the same rank to films with the same rental duration.

OVER (ORDER BY rental_duration DESC) ranks from longest to shortest duration.

The CTE simplifies reuse and allows filtering, joining, or more aggregation in the next steps.

Would you like to use DENSE_RANK or ROW_NUMBER instead, or filter to show only the top 5 longest-rented films?

9.CTE and Filtering:

 a. Create a CTE to list customers who have made more than two rentals, and then join this CTE with the

 customer table to retrieve

 Goal:
Retrieve:

Customer full name

Email

Number of rentals
For customers who have more than 2 rentals

 Tables Involved:
rental – stores rental transactions (includes customer_id)

customer – stores customer details

 CTE with Filtering:
sql
Copy
Edit
-- Step 1: CTE to find customers with more than 2 rentals
WITH frequent_customers AS (
    SELECT
        customer_id,
        COUNT(rental_id) AS rental_count
    FROM
        rental
    GROUP BY
        customer_id
    HAVING
        COUNT(rental_id) > 2
)

-- Step 2: Join with customer table to get details
SELECT
    CONCAT(c.first_name, ' ', c.last_name) AS customer_name,
    c.email,
    fc.rental_count
FROM
    frequent_customers fc
JOIN
    customer c ON fc.customer_id = c.customer_id
ORDER BY
    fc.rental_count DESC;
 Sample Output:
customer_name	email	rental_count
John Doe	john.doe@email.com	15
Alice Johnson	alice.j@email.com	9
Carlos García	carlosg@email.com	3

 Explanation:
The CTE frequent_customers counts rentals per customer.

HAVING COUNT(rental_id) > 2 filters only customers with more than 2 rentals.

We join with customer to get the full name and email.

Results are ordered by the number of rentals, descending.

Would you like to add filters like city or store as well?

10. CTE for Date Calculations:

 a. Write a query using a CTE to find the total number of rentals made each month, considering the

 rental_da

-- Step 1: CTE to extract year and month, then count rentals
WITH monthly_rentals AS (
    SELECT
        DATE_FORMAT(rental_date, '%Y-%m') AS rental_month,
        COUNT(*) AS total_rentals
    FROM
        rental
    GROUP BY
        DATE_FORMAT(rental_date, '%Y-%m')
)

-- Step 2: Select from CTE
SELECT
    rental_month,
    total_rentals
FROM
    monthly_rentals
ORDER BY
    rental_month;

11. CTE and Self-Join:

 a. Create a CTE to generate a report showing pairs of actors who have appeared in the same film

 together, using the film_actor

-- Step 1: CTE to find actor pairs in the same film
WITH actor_pairs AS (
    SELECT
        fa1.film_id,
        fa1.actor_id AS actor1_id,
        fa2.actor_id AS actor2_id
    FROM
        film_actor fa1
    JOIN
        film_actor fa2 ON fa1.film_id = fa2.film_id
        AND fa1.actor_id < fa2.actor_id  -- avoid duplicate pairs and self-pairing
)

-- Step 2: Join CTE with actor and film tables to get names and film title
SELECT
    f.title AS film_title,
    CONCAT(a1.first_name, ' ', a1.last_name) AS actor1_name,
    CONCAT(a2.first_name, ' ', a2.last_name) AS actor2_name
FROM
    actor_pairs ap
JOIN
    actor a1 ON ap.actor1_id = a1.actor_id
JOIN
    actor a2 ON ap.actor2_id = a2.actor_id
JOIN
    film f ON ap.film_id = f.film_id
ORDER BY
    film_title, actor1_name, actor2_name;

12. CTE for Recursive Search:

 a. Implement a recursive CTE to find all employees in the staff table who report to a specific manager,

 considering the

-- Replace :manager_id with the actual manager's staff_id you want to search under
WITH RECURSIVE reporting_hierarchy AS (
    -- Anchor member: select the manager
    SELECT
        staff_id,
        first_name,
        last_name,
        manager_staff_id
    FROM
        staff
    WHERE
        staff_id = :manager_id

    UNION ALL

    -- Recursive member: select employees reporting to those in previous step
    SELECT
        s.staff_id,
        s.first_name,
        s.last_name,
        s.manager_staff_id
    FROM
        staff s
    INNER JOIN
        reporting_hierarchy rh ON s.manager_staff_id = rh.staff_id
)

-- Final output excluding the root manager (optional)
SELECT
    staff_id,
    CONCAT(first_name, ' ', last_name) AS staff_name,
    manager_staff_id
FROM
    reporting_hierarchy
WHERE
    staff_id != :manager_id;